{"VPAC2": ["The third extracellular loop of the human calcitonin receptor-like receptor is crucial for the activation of adrenomedullin signalling.", "Flow cytometric analysis of the calcitonin receptor-like receptor domains responsible for cell-surface translocation of receptor activity-modifying proteins."], "VPAC1": ["Novel receptor partners and function of receptor activity-modifying proteins."], "Glucagon": ["Novel receptor partners and function of receptor activity-modifying proteins.", "Modulation of Glucagon Receptor Pharmacology by Receptor Activity-modifying Protein-2 (RAMP2).", "Receptor activity modifying proteins (RAMPs) interact with the VPAC2 receptor and CRF1 receptors and modulate their function.", "[RAMPs and G protein coupled receptors].", "Recycling of glucagon receptor to plasma membrane increases in adipocytes of obese rats by soy protein; implications for glucagon resistance.", "Endothelial Restoration of Receptor Activity-Modifying Protein 2 Is Sufficient to Rescue Lethality, but Survivors Develop Dilated Cardiomyopathy.", "RAMP2 influences glucagon receptor pharmacology via trafficking and signaling."], "AMY1": ["Amylin receptor phenotypes derived from human calcitonin receptor/RAMP coexpression exhibit pharmacological differences dependent on receptor isoform and host cell environment", "Amylin receptors: molecular composition and pharmacology", "Calcitonin Receptors: Introduction", "Calcitonin and calcitonin receptor-like receptors: common themes with family B GPCRs?", "Complexing receptor pharmacology: modulation of family B G protein-coupled receptor function by RAMPs", "Functions of third extracellular loop and helix 8 of Family B GPCRs complexed with RAMPs and characteristics of their receptor trafficking.", "Flow cytometric analysis of the calcitonin receptor-like receptor domains responsible for cell-surface translocation of receptor activity-modifying proteins.", "Extracellular loops 1 and 3 and their associated transmembrane regions of the calcitonin receptor-like receptor are needed for CGRP receptor function.", "The transmembrane domain of receptor-activity-modifying protein 1 is essential for the functional expression of a calcitonin gene-related peptide receptor.", "Novel peptide antagonists of adrenomedullin and calcitonin gene-related peptide receptors: identification, pharmacological characterization, and interactions with position 74 in receptor activity-modifying protein 1/3.", "Adrenomedullin is induced by hypoxia and enhances pancreatic cancer cell invasion.", "Roles of receptor activity-modifying protein 1 in angiogenesis and lymphangiogenesis during skin wound healing in mice.", "Periaqueductal gray calcitonin gene-related peptide modulates trigeminovascular neurons.", "Identification and pharmacological characterization of domains involved in binding of CGRP receptor antagonists to the calcitonin-like receptor.", "Role of cerebellar adrenomedullin in blood pressure regulation.", "Determinants of 1-piperidinecarboxamide, N-[2-[[5-amino-l-[[4-(4-pyridinyl)-l-piperazinyl]carbonyl]pentyl]amino]-1-[(3,5-dibromo-4-hydroxyphenyl)methyl]-2-oxoethyl]-4-(1,4-dihydro-2-oxo-3(2H)-quinazolinyl) (BIBN4096BS) affinity for calcitonin gene-related peptide and amylin receptors--the role of receptor activity modifying protein 1.", "Adrenomedullin 2 Enhances Beiging in White Adipose Tissue Directly in an Adipocyte-autonomous Manner and Indirectly through Activation of M2 Macrophages.", "[Regulatory mechanisms of calcitonin gene-related peptide (CGRP) in skin inflammation].", "Calcitonin and Amylin Receptor Peptide Interaction Mechanisms: INSIGHTS INTO PEPTIDE-BINDING MODES AND ALLOSTERIC MODULATION OF THE CALCITONIN RECEPTOR BY RECEPTOR ACTIVITY-MODIFYING PROTEINS.", "The effects of C-terminal truncation of receptor activity modifying proteins on the induction of amylin receptor phenotype from human CTb receptors.", "Identification of the human receptor activity-modifying protein 1 domains responsible for agonist binding specificity.", "Receptor activity-modifying protein 1 increases baroreflex sensitivity and attenuates Angiotensin-induced hypertension.", "Distinct receptor activity-modifying protein domains differentially modulate interaction with calcitonin receptors.", "Osteoclast-like cells express receptor activity modifying protein 2: application of laser capture microdissection.", "Activation of calcitonin gene-related peptide signaling through the prostaglandin E2-EP1/EP2/EP4 receptor pathway in synovium of knee osteoarthritis patients.", "Amylin receptor components and the leptin receptor are co-expressed in single rat area postrema neurons.", "Locally synthesized calcitonin gene-related Peptide has a critical role in peripheral nerve regeneration.", "Ligand binding and activation of the CGRP receptor.", "Heterodimers and family-B GPCRs: RAMPs, CGRP and adrenomedullin.", "Localization of calcitonin receptor-like receptor and receptor activity modifying protein 1 in enteric neurons, dorsal root ganglia, and the spinal cord of the rat.", "Amylin receptors: molecular composition and pharmacology.", "The second intracellular loop of the calcitonin gene-related peptide receptor provides molecular determinants for signal transduction and cell surface expression.", "Molecular cloning and characterization of mouse calcitonin gene-related peptide receptor.", "Calcitonin gene-related peptide enhances experimental autoimmune encephalomyelitis by promoting Th17-cell functions.", "Receptor activity modifying proteins interaction with human and porcine calcitonin receptor-like receptor (CRLR) in HEK-293 cells.", "Non-peptidic antagonists of the CGRP receptor, BIBN4096BS and MK-0974, interact with the calcitonin receptor-like receptor via methionine-42 and RAMP1 via tryptophan-74.", "Interaction of receptor-activity-modifying protein1 with tubulin.", "The activation of the CGRP receptor.", "Mapping the CGRP receptor ligand binding domain: tryptophan-84 of RAMP1 is critical for agonist and antagonist binding.", "Endosomal proteolysis regulates calcitonin gene-related peptide responses in mesenteric arteries.", "Structural Basis for Receptor Activity-Modifying Protein-Dependent Selective Peptide Recognition by a G Protein-Coupled Receptor.", "Keratinocytes express cytokines and nerve growth factor in response to neuropeptide activation of the ERK1/2 and JNK MAPK transcription pathways.", "Pharmacological characterization of rat amylin receptors: implications for the identification of amylin receptor subtypes.", "Localization of the calcitonin gene-related peptide receptor complex at the vertebrate neuromuscular junction and its role in regulating acetylcholinesterase expression.", "Expression of functional receptor activity modifying protein 1 by airway epithelial cells with dysregulation in asthma.", "Antipsychotic-like actions of the satiety peptide, amylin, in ventral striatal regions marked by overlapping calcitonin receptor and RAMP-1 gene expression.", "Adrenomedullin and related peptides: receptors and accessory proteins.", "Modulation of nocioceptive transmission with calcitonin gene-related peptide receptor antagonists in the thalamus.", "Sequencing of a calcitonin receptor-like receptor in salmon Oncorhynchus gorbuscha. Functional studies using the human receptor activity-modifying proteins.", "A critical role for the short intracellular C terminus in receptor activity-modifying protein function.", "Specificity of porcine calcitonin receptor and calcitonin receptor-like receptor in the presence of receptor-activity-modifying proteins.", "Receptor component protein (RCP): a member of a multi-protein complex required for G-protein-coupled signal transduction.", "Functional relevance of G-protein-coupled-receptor-associated proteins, exemplified by receptor-activity-modifying proteins (RAMPs).", "Quinoline derivatives: candidate drugs for a class B G-protein coupled receptor, the calcitonin gene-related peptide receptor, a cause of migraines.", "Adrenomedullin peptide: gene expression of adrenomedullin, its receptors and receptor activity modifying proteins, and receptor binding in rat testis--actions on testosterone secretion.", "Deficiency of RAMP1 attenuates antigen-induced airway hyperresponsiveness in mice.", "The N-terminal extracellular domain 23-60 of the calcitonin receptor-like receptor in chimeras with the parathyroid hormone receptor mediates association with receptor activity-modifying protein 1.", "Bacterial expression and purification of a heterodimeric adrenomedullin receptor extracellular domain complex using DsbC-assisted disulfide shuffling.", "Adrenomedullin in the rat testis. I: Its production, actions on testosterone secretion, regulation by human chorionic gonadotropin, and its interaction with endothelin 1 in the leydig cell.", "The role of glutamic acid 73 in adrenomedullin interactions with rodent AM2 receptors.", "A second trigeminal CGRP receptor: function and expression of the AMY1 receptor.", "Enhanced vascular responses to adrenomedullin in mice overexpressing receptor-activity-modifying protein 2.", "Unaltered mRNA expression of calcitonin-like receptor and receptor activity modifying proteins in human arteries in stroke and myocardial infarction.", "Visualization of the calcitonin receptor-like receptor and its receptor activity-modifying proteins during internalization and recycling.", "Structure-function analysis of RAMP1-RAMP3 chimeras.", "The extracellular domain of receptor activity-modifying protein 1 is sufficient for calcitonin receptor-like receptor function.", "Receptor activity-modifying protein 1 determines the species selectivity of non-peptide CGRP receptor antagonists.", "Epidermal nerve fibers modulate keratinocyte growth via neuropeptide signaling in an innervated skin model.", "The extreme N-terminus of the calcitonin-like receptor contributes to the selective interaction with adrenomedullin or calcitonin gene-related peptide.", "Cloning, characterization and central nervous system distribution of receptor activity modifying proteins in the rat.", "Structure-function relationships of the N-terminus of receptor activity-modifying proteins.", "Structure-function analysis of RAMP1 by alanine mutagenesis.", "Immature human osteoblastic MG63 cells predominantly express a subtype 1-like CGRP receptor that inactivates extracellular signal response kinase by a cAMP-dependent mechanism.", "Identification of N-terminal receptor activity-modifying protein residues important for calcitonin gene-related peptide, adrenomedullin, and amylin receptor function.", "Intermedin stabilized endothelial barrier function and attenuated ventilator-induced lung injury in mice.", "The RAMP2/CRLR complex is a functional adrenomedullin receptor in human endothelial and vascular smooth muscle cells.", "Adrenomedullin enhances the progressive motility and zona pellucida-binding capacity of spermatozoa from normozoospermic but not asthenozoospermic men.", "Expression of receptor-activity modifying protein (RAMP) mRNAs in the mouse brain.", "Ca2+ signaling in human fetoplacental vasculature: effect of CGRP on umbilical vein smooth muscle cytosolic Ca2+ concentration.", "Receptor-activity-modifying protein 1 forms heterodimers with two G-protein-coupled receptors to define ligand recognition.", "Expression of calcitonin gene-related peptide type 1 receptor mRNA and their activity-modifying proteins in the rat nucleus accumbens.", "Progesterone upregulates calcitonin gene-related peptide and adrenomedullin receptor components and cyclic adenosine 3'5'-monophosphate generation in Eker rat uterine smooth muscle cell line.", "Antiapoptotic effect of calcitonin gene-related peptide on oxidative stress-induced injury in H9c2 cardiomyocytes via the RAMP1/CRLR complex.", "Protein-protein interaction and not glycosylation determines the binding selectivity of heterodimers between the calcitonin receptor-like receptor and the receptor activity-modifying proteins.", "Pharmacological characterization of novel alpha-Calcitonin Gene-Related Peptide (CGRP) receptor peptide antagonists that are selective for human CGRP receptors.", "Molecular basis of association of receptor activity-modifying protein 3 with the family B G protein-coupled secretin receptor.", "Amylin(1-8) is devoid of anabolic activity in bone.", "STC1 interference on calcitonin family of receptors signaling during osteoblastogenesis via adenylate cyclase inhibition.", "The function of conserved cysteine residues in the extracellular domain of human receptor-activity-modifying protein.", "Localization of CGRP receptor components and receptor binding sites in rhesus monkey brainstem: A detailed study using in situ hybridization, immunofluorescence, and autoradiography.", "Mammalian calcitonin receptor-like receptor/receptor activity modifying protein complexes define calcitonin gene-related peptide and adrenomedullin receptors in Drosophila Schneider 2 cells.", "RAMP1 is a direct NKX3.1 target gene up-regulated in prostate cancer that promotes tumorigenesis.", "Amylin receptor phenotypes derived from human calcitonin receptor/RAMP coexpression exhibit pharmacological differences dependent on receptor isoform and host cell environment.", "Studies on the effects of the N-terminal domain antibodies of calcitonin receptor-like receptor and receptor activity-modifying protein 1 on calcitonin gene-related peptide-induced vasorelaxation in rat uterine artery.", "Female sex steroid hormones and pregnancy regulate receptors for calcitonin gene-related peptide in rat mesenteric arteries, but not in aorta.", "Localization of CGRP, CGRP receptor, PACAP and glutamate in trigeminal ganglion. Relation to the blood-brain barrier.", "Mapping interaction sites within the N-terminus of the calcitonin gene-related peptide receptor; the role of residues 23-60 of the calcitonin receptor-like receptor.", "Novel function for receptor activity-modifying proteins (RAMPs) in post-endocytic receptor trafficking.", "Calcitonin gene-related peptide receptor activation by receptor activity-modifying protein-1 gene transfer to vascular smooth muscle cells.", "Calcitonin gene-related peptide is an important regulator of cutaneous immunity: effect on dendritic cell and T cell functions.", "Interaction of calcitonin-gene-related peptide with its receptors.", "Crystal structure of the human receptor activity-modifying protein 1 extracellular domain.", "Adrenomedullin and calcitonin gene-related peptide receptors in the rat adrenal cortex.", "Differential localization and characterization of functional calcitonin gene-related peptide receptors in human subcutaneous arteries.", "Refolding and characterization of a soluble ectodomain complex of the calcitonin gene-related peptide receptor.", "Functional expression of heteromeric calcitonin gene-related peptide and adrenomedullin receptors in yeast.", "Haplotype-based case-control study of receptor (calcitonin) activity-modifying protein-1 gene in cerebral infarction.", "Receptor activity-modifying protein-dependent effects of mutations in the calcitonin receptor-like receptor: implications for adrenomedullin and calcitonin gene-related peptide pharmacology.", "Evidence for decreased calcitonin gene-related peptide (CGRP) receptors and compromised responsiveness to CGRP of fetoplacental vessels in preeclamptic pregnancies.", "Maturation of suprathreshold auditory nerve activity involves cochlear CGRP-receptor complex formation.", "An amylin receptor is revealed following co-transfection of a calcitonin receptor with receptor activity modifying proteins-1 or -3.", "Calcitonin gene-related peptide (CGRP) receptors are important to maintain cerebrovascular reactivity in chronic hypertension.", "A receptor activity modifying protein (RAMP)2-dependent adrenomedullin receptor is a calcitonin gene-related peptide receptor when coexpressed with human RAMP1.", "GPCRs as potential therapeutic targets in preeclampsia.", "Adrenomedullin signalling in cardiomyocytes is dependent upon CRLR and RAMP2 expression.", "Assembly and signaling of CRLR and RAMP1 complexes assessed by BRET.", "Receptor activity-modifying proteins differentially modulate the G protein-coupling efficiency of amylin receptors.", "Functional interaction of G protein-coupled receptors of the adrenomedullin peptide family with accessory receptor-activity-modifying proteins (RAMP).", "An allosteric role for receptor activity-modifying proteins in defining GPCR pharmacology.", "The role of ECL2 in CGRP receptor activation: a combined modelling and experimental approach.", "Structure-function analysis of amino acid 74 of human RAMP1 and RAMP3 and its role in peptide interactions with adrenomedullin and calcitonin gene-related peptide receptors.", "Peripheral amylin activates circumventricular organs expressing calcitonin receptor a/b subtypes and receptor-activity modifying proteins in the rat.", "Identification of specific calcitonin-like receptor residues important for calcitonin gene-related peptide high affinity binding.", "Characterization of the human calcitonin gene-related peptide receptor subtypes associated with receptor activity-modifying proteins.", "Direct interactions between calcitonin-like receptor (CLR) and CGRP-receptor component protein (RCP) regulate CGRP receptor signaling.", "The role of the extracellular loops of the CGRP receptor, a family B GPCR.", "Glyceroltrinitrate facilitates stimulated CGRP release but not gene expression of CGRP or its receptor components in rat trigeminal ganglia.", "Calcitonin gene-related peptide and its receptor components in the human sphenopalatine ganglion -- interaction with the sensory system.", "Co-expression of adrenomedullin and adrenomedullin receptors in rat epididymis: distinct physiological actions on anion transport.", "The central anorexigenic mechanism of amylin in Japanese quail (Coturnix japonica) involves pro-opiomelanocortin, calcitonin receptor, and the arcuate nucleus of the hypothalamus.", "Neuropeptide deficient mice have attenuated nociceptive, vascular, and inflammatory changes in a tibia fracture model of complex regional pain syndrome.", "Localization of receptors for calcitonin-gene-related peptide to intraganglionic laminar endings of the mouse esophagus: peripheral interaction between vagal and spinal afferents?", "Targeting a family B GPCR/RAMP receptor complex: CGRP receptor antagonists and migraine.", "Neuronal receptor activity-modifying protein 1 promotes energy expenditure in mice.", "Involvement of vascular endothelial growth factor signaling in CLR/RAMP1 and CLR/RAMP2-mediated pro-angiogenic effect of intermedin on human vascular endothelial cells.", "Kynurenic acid modulates experimentally induced inflammation in the trigeminal ganglion.", "Endothelin-converting enzyme-1 regulates endosomal sorting of calcitonin receptor-like receptor and beta-arrestins.", "Activation of calcitonin receptor and calcitonin receptor-like receptor by membrane-anchored ligands.", "Localization of CGRP receptor components, CGRP, and receptor binding sites in human and rhesus cerebellar cortex.", "Mouse receptor-activity-modifying proteins 1, -2 and -3: amino acid sequence, expression and function.", "RAMPs and CGRP receptors.", "The CGRP receptor can couple via pertussis toxin sensitive and insensitive G proteins.", "Receptor pharmacology.", "Functional calcitonin gene-related peptide subtype 2 receptors in porcine coronary arteries are identified as calcitonin gene-related peptide subtype 1 receptors by radioligand binding and reverse transcription-polymerase chain reaction.", "CGRP in the trigeminovascular system: a role for CGRP, adrenomedullin and amylin receptors?", "A key role for tryptophan 84 in receptor activity-modifying protein 1 in the amylin 1 receptor.", "Aspartate(69) of the calcitonin-like receptor is required for its functional expression together with receptor-activity-modifying proteins 1 and -2.", "Calcitonin Gene-Related Peptide Rescues Proximity Associations of Its Receptor Components, Calcitonin Receptor-Like Receptor and Receptor Activity-Modifying Protein 1, in Rat Uterine Artery Smooth Muscle Cells Exposed to Tumor Necrosis Factor Alpha.", "Differential and cell-specific expression of calcitonin receptor-like receptor and receptor activity modifying proteins in the human uterus.", "Quantitative structure-activity relationships and docking studies of calcitonin gene-related peptide antagonists.", "Role of CGRP-receptor component protein (RCP) in CLR/RAMP function.", "Decreased gene expression of adrenomedullin receptor in mouse lungs during sepsis.", "Comparing the molecular pharmacology of CGRP and adrenomedullin.", "CGRP receptor antagonism and migraine therapy.", "[Alterations of intermedin and its receptor system in oleic acid-induced acute lung injury of rats].", "Expression of calcitonin receptor in rat mammary gland during lactation.", "Receptor activity-modifying protein (RAMP) isoform-specific regulation of adrenomedullin receptor trafficking by NHERF-1.", "Respective roles of calcitonin receptor-like receptor (CRLR) and receptor activity-modifying proteins (RAMP) in cell surface expression of CRLR/RAMP heterodimeric receptors.", "The seven amino acids of human RAMP2 (86) and RAMP3 (59) are critical for agonist binding to human adrenomedullin receptors.", "Regulation and function of the CGRP receptor complex in human granulopoiesis.", "Functions of the cytoplasmic tails of the human receptor activity-modifying protein components of calcitonin gene-related peptide and adrenomedullin receptors.", "Dexamethasone increases RAMP1 and CRLR mRNA expressions in human vascular smooth muscle cells.", "Proceedings of the 4th International Meeting on Calcitonin Gene-Related Peptide and its Receptor.", "Receptors for calcitonin gene-related peptide, adrenomedullin, and amylin: the contributions of novel receptor-activity-modifying proteins.", "The amino terminus of receptor activity modifying proteins is a critical determinant of glycosylation state and ligand binding of calcitonin receptor-like receptor.", "Molecular cloning and pharmacological characterization of bovine calcitonin receptor-like receptor from bovine aortic endothelial cells.", "Agonist-promoted internalization of a ternary complex between calcitonin receptor-like receptor, receptor activity-modifying protein 1 (RAMP1), and beta-arrestin.", "Mutations of the asparagine117 residue of a receptor activity-modifying protein 1-dependent human calcitonin gene-related peptide receptor result in selective loss of function.", "Glycosylation of human CRLR at Asn123 is required for ligand binding and signaling.", "CGRP and its receptors.", "Characterization of the structure of RAMP1 by mutagenesis and molecular modeling.", "Multiple ramp domains are required for generation of amylin receptor phenotype from the calcitonin receptor gene product.", "Functional calcitonin gene-related peptide receptors are formed by the asymmetric assembly of a calcitonin receptor-like receptor homo-oligomer and a monomer of receptor activity-modifying protein-1."], "AMY3": ["Amylin receptor phenotypes derived from human calcitonin receptor/RAMP coexpression exhibit pharmacological differences dependent on receptor isoform and host cell environment", "Amylin receptors: molecular composition and pharmacology", "Calcitonin Receptors: Introduction", "Calcitonin and calcitonin receptor-like receptors: common themes with family B GPCRs?", "The third extracellular loop of the human calcitonin receptor-like receptor is crucial for the activation of adrenomedullin signalling.", "Functions of third extracellular loop and helix 8 of Family B GPCRs complexed with RAMPs and characteristics of their receptor trafficking.", "Novel receptor partners and function of receptor activity-modifying proteins.", "Flow cytometric analysis of the calcitonin receptor-like receptor domains responsible for cell-surface translocation of receptor activity-modifying proteins.", "Novel peptide antagonists of adrenomedullin and calcitonin gene-related peptide receptors: identification, pharmacological characterization, and interactions with position 74 in receptor activity-modifying protein 1/3.", "Adrenomedullin is induced by hypoxia and enhances pancreatic cancer cell invasion.", "Role of cerebellar adrenomedullin in blood pressure regulation.", "Determinants of 1-piperidinecarboxamide, N-[2-[[5-amino-l-[[4-(4-pyridinyl)-l-piperazinyl]carbonyl]pentyl]amino]-1-[(3,5-dibromo-4-hydroxyphenyl)methyl]-2-oxoethyl]-4-(1,4-dihydro-2-oxo-3(2H)-quinazolinyl) (BIBN4096BS) affinity for calcitonin gene-related peptide and amylin receptors--the role of receptor activity modifying protein 1.", "The effects of C-terminal truncation of receptor activity modifying proteins on the induction of amylin receptor phenotype from human CTb receptors.", "Osteoclast-like cells express receptor activity modifying protein 2: application of laser capture microdissection.", "Amylin receptor components and the leptin receptor are co-expressed in single rat area postrema neurons.", "Heterodimers and family-B GPCRs: RAMPs, CGRP and adrenomedullin.", "Localization of calcitonin receptor-like receptor and receptor activity modifying protein 1 in enteric neurons, dorsal root ganglia, and the spinal cord of the rat.", "Amylin receptors: molecular composition and pharmacology.", "Receptor activity modifying proteins interaction with human and porcine calcitonin receptor-like receptor (CRLR) in HEK-293 cells.", "Pharmacological characterization of rat amylin receptors: implications for the identification of amylin receptor subtypes.", "Sequencing of a calcitonin receptor-like receptor in salmon Oncorhynchus gorbuscha. Functional studies using the human receptor activity-modifying proteins.", "A critical role for the short intracellular C terminus in receptor activity-modifying protein function.", "Specificity of porcine calcitonin receptor and calcitonin receptor-like receptor in the presence of receptor-activity-modifying proteins.", "Functional relevance of G-protein-coupled-receptor-associated proteins, exemplified by receptor-activity-modifying proteins (RAMPs).", "Adrenomedullin peptide: gene expression of adrenomedullin, its receptors and receptor activity modifying proteins, and receptor binding in rat testis--actions on testosterone secretion.", "Bacterial expression and purification of a heterodimeric adrenomedullin receptor extracellular domain complex using DsbC-assisted disulfide shuffling.", "Adrenomedullin in the rat testis. I: Its production, actions on testosterone secretion, regulation by human chorionic gonadotropin, and its interaction with endothelin 1 in the leydig cell.", "The role of glutamic acid 73 in adrenomedullin interactions with rodent AM2 receptors.", "Unaltered mRNA expression of calcitonin-like receptor and receptor activity modifying proteins in human arteries in stroke and myocardial infarction.", "Visualization of the calcitonin receptor-like receptor and its receptor activity-modifying proteins during internalization and recycling.", "Structure-function analysis of RAMP1-RAMP3 chimeras.", "Cloning, characterization and central nervous system distribution of receptor activity modifying proteins in the rat.", "Identification of N-terminal receptor activity-modifying protein residues important for calcitonin gene-related peptide, adrenomedullin, and amylin receptor function.", "Intermedin stabilized endothelial barrier function and attenuated ventilator-induced lung injury in mice.", "The RAMP2/CRLR complex is a functional adrenomedullin receptor in human endothelial and vascular smooth muscle cells.", "Adrenomedullin enhances the progressive motility and zona pellucida-binding capacity of spermatozoa from normozoospermic but not asthenozoospermic men.", "Expression of calcitonin gene-related peptide type 1 receptor mRNA and their activity-modifying proteins in the rat nucleus accumbens.", "Progesterone upregulates calcitonin gene-related peptide and adrenomedullin receptor components and cyclic adenosine 3'5'-monophosphate generation in Eker rat uterine smooth muscle cell line.", "Antiapoptotic effect of calcitonin gene-related peptide on oxidative stress-induced injury in H9c2 cardiomyocytes via the RAMP1/CRLR complex.", "Molecular basis of association of receptor activity-modifying protein 3 with the family B G protein-coupled secretin receptor.", "Amylin receptor phenotypes derived from human calcitonin receptor/RAMP coexpression exhibit pharmacological differences dependent on receptor isoform and host cell environment.", "Novel function for receptor activity-modifying proteins (RAMPs) in post-endocytic receptor trafficking.", "Adrenomedullin and calcitonin gene-related peptide receptors in the rat adrenal cortex.", "Functional expression of heteromeric calcitonin gene-related peptide and adrenomedullin receptors in yeast.", "Receptor activity-modifying protein-dependent effects of mutations in the calcitonin receptor-like receptor: implications for adrenomedullin and calcitonin gene-related peptide pharmacology.", "Receptor activity-modifying proteins differentially modulate the G protein-coupling efficiency of amylin receptors.", "Structure-function analysis of amino acid 74 of human RAMP1 and RAMP3 and its role in peptide interactions with adrenomedullin and calcitonin gene-related peptide receptors.", "Characterization of the human calcitonin gene-related peptide receptor subtypes associated with receptor activity-modifying proteins.", "Involvement of vascular endothelial growth factor signaling in CLR/RAMP1 and CLR/RAMP2-mediated pro-angiogenic effect of intermedin on human vascular endothelial cells.", "Receptor pharmacology.", "Differential and cell-specific expression of calcitonin receptor-like receptor and receptor activity modifying proteins in the human uterus.", "Decreased gene expression of adrenomedullin receptor in mouse lungs during sepsis.", "Expression of calcitonin receptor in rat mammary gland during lactation.", "Receptor activity-modifying protein (RAMP) isoform-specific regulation of adrenomedullin receptor trafficking by NHERF-1.", "Respective roles of calcitonin receptor-like receptor (CRLR) and receptor activity-modifying proteins (RAMP) in cell surface expression of CRLR/RAMP heterodimeric receptors.", "The seven amino acids of human RAMP2 (86) and RAMP3 (59) are critical for agonist binding to human adrenomedullin receptors.", "Receptors for calcitonin gene-related peptide, adrenomedullin, and amylin: the contributions of novel receptor-activity-modifying proteins.", "The amino terminus of receptor activity modifying proteins is a critical determinant of glycosylation state and ligand binding of calcitonin receptor-like receptor.", "Molecular cloning and pharmacological characterization of bovine calcitonin receptor-like receptor from bovine aortic endothelial cells.", "Glycosylation of human CRLR at Asn123 is required for ligand binding and signaling.", "Ligand-induced internalization, recycling, and resensitization of adrenomedullin receptors depend not on CLR or RAMP alone but on the receptor complex as a whole.", "IAPP-driven metabolic reprogramming induces regression of p53-deficient tumours in vivo.", "Gene silencing of human RAMP2 mediated by short-interfering RNA.", "Receptor Activity-modifying Proteins 2 and 3 Generate Adrenomedullin Receptor Subtypes with Distinct Molecular Properties.", "Adrenomedullin is increased in alveolar macrophages and released from the lungs into the circulation in severe heart failure.", "Receptor activity-modifying proteins 2 and 3 have distinct physiological functions from embryogenesis to old age.", "Expression and distribution of the adrenomedullin system in newborn human thymus.", "Parathyroid hormone induces receptor activity modifying protein-3 (RAMP3) expression primarily via 3',5'-cyclic adenosine monophosphate signaling in osteoblasts.", "Characterization of the single transmembrane domain of human receptor activity-modifying protein 3 in adrenomedullin receptor internalization.", "The pharmacology of adrenomedullin 2/intermedin.", "The role of adrenomedullin and receptors in glomerular hyperfiltration in streptozotocin-induced diabetic rats.", "Novel regulation of adrenomedullin receptor by PDGF: role of receptor activity modifying protein-3.", "The estrogen-responsive adrenomedullin and receptor-modifying protein 3 gene identified by DNA microarray analysis are directly regulated by estrogen receptor.", "Functional characterization of two human receptor activity-modifying protein 3 variants.", "Intermedin is upregulated and has protective roles in a mouse ischemia/reperfusion model.", "Involvement of Receptor Activity-Modifying Protein 3 (RAMP3) in the Vascular Actions of Adrenomedullin in Rat Mesenteric Artery Smooth Muscle Cells.", "CL/RAMP2 and CL/RAMP3 produce pharmacologically distinct adrenomedullin receptors: a comparison of effects of adrenomedullin22-52, CGRP8-37 and BIBN4096BS.", "N-Glycosylation and conserved cysteine residues in RAMP3 play a critical role for the functional expression of CRLR/RAMP3 adrenomedullin receptor.", "Loss of receptor activity-modifying protein 3 exacerbates cardiac hypertrophy and transition to heart failure in a sex-dependent manner.", "Functional Analysis of the Adrenomedullin Pathway in Malignant Pleural Mesothelioma.", "Adrenomedullin and its receptor complexes in remnant kidneys of rats with renal mass ablation: decreased expression of calcitonin receptor-like receptor and receptor-activity modifying protein-3.", "Adrenomedullin2 (ADM2)/Intermedin (IMD): A Potential Role in the Pathophysiology of Preeclampsia.", "Intermedin1-53 protects the heart against isoproterenol-induced ischemic injury in rats."], "AMY2": ["Amylin receptor phenotypes derived from human calcitonin receptor/RAMP coexpression exhibit pharmacological differences dependent on receptor isoform and host cell environment", "Amylin receptors: molecular composition and pharmacology", "Calcitonin Receptors: Introduction", "Calcitonin and calcitonin receptor-like receptors: common themes with family B GPCRs?", "The third extracellular loop of the human calcitonin receptor-like receptor is crucial for the activation of adrenomedullin signalling.", "Functions of third extracellular loop and helix 8 of Family B GPCRs complexed with RAMPs and characteristics of their receptor trafficking.", "Novel receptor partners and function of receptor activity-modifying proteins.", "Flow cytometric analysis of the calcitonin receptor-like receptor domains responsible for cell-surface translocation of receptor activity-modifying proteins.", "Endothelial Restoration of Receptor Activity-Modifying Protein 2 Is Sufficient to Rescue Lethality, but Survivors Develop Dilated Cardiomyopathy.", "Novel peptide antagonists of adrenomedullin and calcitonin gene-related peptide receptors: identification, pharmacological characterization, and interactions with position 74 in receptor activity-modifying protein 1/3.", "Adrenomedullin is induced by hypoxia and enhances pancreatic cancer cell invasion.", "Role of cerebellar adrenomedullin in blood pressure regulation.", "Determinants of 1-piperidinecarboxamide, N-[2-[[5-amino-l-[[4-(4-pyridinyl)-l-piperazinyl]carbonyl]pentyl]amino]-1-[(3,5-dibromo-4-hydroxyphenyl)methyl]-2-oxoethyl]-4-(1,4-dihydro-2-oxo-3(2H)-quinazolinyl) (BIBN4096BS) affinity for calcitonin gene-related peptide and amylin receptors--the role of receptor activity modifying protein 1.", "Calcitonin and Amylin Receptor Peptide Interaction Mechanisms: INSIGHTS INTO PEPTIDE-BINDING MODES AND ALLOSTERIC MODULATION OF THE CALCITONIN RECEPTOR BY RECEPTOR ACTIVITY-MODIFYING PROTEINS.", "The effects of C-terminal truncation of receptor activity modifying proteins on the induction of amylin receptor phenotype from human CTb receptors.", "Distinct receptor activity-modifying protein domains differentially modulate interaction with calcitonin receptors.", "Osteoclast-like cells express receptor activity modifying protein 2: application of laser capture microdissection.", "Amylin receptor components and the leptin receptor are co-expressed in single rat area postrema neurons.", "Localization of calcitonin receptor-like receptor and receptor activity modifying protein 1 in enteric neurons, dorsal root ganglia, and the spinal cord of the rat.", "Amylin receptors: molecular composition and pharmacology.", "Receptor activity modifying proteins interaction with human and porcine calcitonin receptor-like receptor (CRLR) in HEK-293 cells.", "Structural Basis for Receptor Activity-Modifying Protein-Dependent Selective Peptide Recognition by a G Protein-Coupled Receptor.", "Sequencing of a calcitonin receptor-like receptor in salmon Oncorhynchus gorbuscha. Functional studies using the human receptor activity-modifying proteins.", "Specificity of porcine calcitonin receptor and calcitonin receptor-like receptor in the presence of receptor-activity-modifying proteins.", "Functional relevance of G-protein-coupled-receptor-associated proteins, exemplified by receptor-activity-modifying proteins (RAMPs).", "Adrenomedullin peptide: gene expression of adrenomedullin, its receptors and receptor activity modifying proteins, and receptor binding in rat testis--actions on testosterone secretion.", "Bacterial expression and purification of a heterodimeric adrenomedullin receptor extracellular domain complex using DsbC-assisted disulfide shuffling.", "Adrenomedullin in the rat testis. I: Its production, actions on testosterone secretion, regulation by human chorionic gonadotropin, and its interaction with endothelin 1 in the leydig cell.", "Enhanced vascular responses to adrenomedullin in mice overexpressing receptor-activity-modifying protein 2.", "Unaltered mRNA expression of calcitonin-like receptor and receptor activity modifying proteins in human arteries in stroke and myocardial infarction.", "Visualization of the calcitonin receptor-like receptor and its receptor activity-modifying proteins during internalization and recycling.", "The extreme N-terminus of the calcitonin-like receptor contributes to the selective interaction with adrenomedullin or calcitonin gene-related peptide.", "Cloning, characterization and central nervous system distribution of receptor activity modifying proteins in the rat.", "Structure-function relationships of the N-terminus of receptor activity-modifying proteins.", "Identification of N-terminal receptor activity-modifying protein residues important for calcitonin gene-related peptide, adrenomedullin, and amylin receptor function.", "Intermedin stabilized endothelial barrier function and attenuated ventilator-induced lung injury in mice.", "The RAMP2/CRLR complex is a functional adrenomedullin receptor in human endothelial and vascular smooth muscle cells.", "Adrenomedullin enhances the progressive motility and zona pellucida-binding capacity of spermatozoa from normozoospermic but not asthenozoospermic men.", "Expression of calcitonin gene-related peptide type 1 receptor mRNA and their activity-modifying proteins in the rat nucleus accumbens.", "Progesterone upregulates calcitonin gene-related peptide and adrenomedullin receptor components and cyclic adenosine 3'5'-monophosphate generation in Eker rat uterine smooth muscle cell line.", "Antiapoptotic effect of calcitonin gene-related peptide on oxidative stress-induced injury in H9c2 cardiomyocytes via the RAMP1/CRLR complex.", "Protein-protein interaction and not glycosylation determines the binding selectivity of heterodimers between the calcitonin receptor-like receptor and the receptor activity-modifying proteins.", "Molecular basis of association of receptor activity-modifying protein 3 with the family B G protein-coupled secretin receptor.", "Mammalian calcitonin receptor-like receptor/receptor activity modifying protein complexes define calcitonin gene-related peptide and adrenomedullin receptors in Drosophila Schneider 2 cells.", "Novel function for receptor activity-modifying proteins (RAMPs) in post-endocytic receptor trafficking.", "Adrenomedullin and calcitonin gene-related peptide receptors in the rat adrenal cortex.", "Functional expression of heteromeric calcitonin gene-related peptide and adrenomedullin receptors in yeast.", "Receptor activity-modifying protein-dependent effects of mutations in the calcitonin receptor-like receptor: implications for adrenomedullin and calcitonin gene-related peptide pharmacology.", "An amylin receptor is revealed following co-transfection of a calcitonin receptor with receptor activity modifying proteins-1 or -3.", "Calcitonin gene-related peptide (CGRP) receptors are important to maintain cerebrovascular reactivity in chronic hypertension.", "A receptor activity modifying protein (RAMP)2-dependent adrenomedullin receptor is a calcitonin gene-related peptide receptor when coexpressed with human RAMP1.", "Adrenomedullin signalling in cardiomyocytes is dependent upon CRLR and RAMP2 expression.", "Peripheral amylin activates circumventricular organs expressing calcitonin receptor a/b subtypes and receptor-activity modifying proteins in the rat.", "Characterization of the human calcitonin gene-related peptide receptor subtypes associated with receptor activity-modifying proteins.", "Co-expression of adrenomedullin and adrenomedullin receptors in rat epididymis: distinct physiological actions on anion transport.", "Involvement of vascular endothelial growth factor signaling in CLR/RAMP1 and CLR/RAMP2-mediated pro-angiogenic effect of intermedin on human vascular endothelial cells.", "Mouse receptor-activity-modifying proteins 1, -2 and -3: amino acid sequence, expression and function.", "Aspartate(69) of the calcitonin-like receptor is required for its functional expression together with receptor-activity-modifying proteins 1 and -2.", "Differential and cell-specific expression of calcitonin receptor-like receptor and receptor activity modifying proteins in the human uterus.", "Decreased gene expression of adrenomedullin receptor in mouse lungs during sepsis.", "[Alterations of intermedin and its receptor system in oleic acid-induced acute lung injury of rats].", "Receptor activity-modifying protein (RAMP) isoform-specific regulation of adrenomedullin receptor trafficking by NHERF-1.", "Respective roles of calcitonin receptor-like receptor (CRLR) and receptor activity-modifying proteins (RAMP) in cell surface expression of CRLR/RAMP heterodimeric receptors.", "The seven amino acids of human RAMP2 (86) and RAMP3 (59) are critical for agonist binding to human adrenomedullin receptors.", "Functions of the cytoplasmic tails of the human receptor activity-modifying protein components of calcitonin gene-related peptide and adrenomedullin receptors.", "Dexamethasone increases RAMP1 and CRLR mRNA expressions in human vascular smooth muscle cells.", "Receptors for calcitonin gene-related peptide, adrenomedullin, and amylin: the contributions of novel receptor-activity-modifying proteins.", "The amino terminus of receptor activity modifying proteins is a critical determinant of glycosylation state and ligand binding of calcitonin receptor-like receptor.", "Molecular cloning and pharmacological characterization of bovine calcitonin receptor-like receptor from bovine aortic endothelial cells.", "Glycosylation of human CRLR at Asn123 is required for ligand binding and signaling.", "Multiple ramp domains are required for generation of amylin receptor phenotype from the calcitonin receptor gene product.", "Ligand-induced internalization, recycling, and resensitization of adrenomedullin receptors depend not on CLR or RAMP alone but on the receptor complex as a whole.", "Gene silencing of human RAMP2 mediated by short-interfering RNA.", "Receptor Activity-modifying Proteins 2 and 3 Generate Adrenomedullin Receptor Subtypes with Distinct Molecular Properties.", "Adrenomedullin is increased in alveolar macrophages and released from the lungs into the circulation in severe heart failure.", "Receptor activity-modifying proteins 2 and 3 have distinct physiological functions from embryogenesis to old age.", "Expression and distribution of the adrenomedullin system in newborn human thymus.", "Characterization of the single transmembrane domain of human receptor activity-modifying protein 3 in adrenomedullin receptor internalization.", "The role of adrenomedullin and receptors in glomerular hyperfiltration in streptozotocin-induced diabetic rats.", "Involvement of Receptor Activity-Modifying Protein 3 (RAMP3) in the Vascular Actions of Adrenomedullin in Rat Mesenteric Artery Smooth Muscle Cells.", "CL/RAMP2 and CL/RAMP3 produce pharmacologically distinct adrenomedullin receptors: a comparison of effects of adrenomedullin22-52, CGRP8-37 and BIBN4096BS.", "Functional Analysis of the Adrenomedullin Pathway in Malignant Pleural Mesothelioma.", "Adrenomedullin and its receptor complexes in remnant kidneys of rats with renal mass ablation: decreased expression of calcitonin receptor-like receptor and receptor-activity modifying protein-3.", "Adrenomedullin2 (ADM2)/Intermedin (IMD): A Potential Role in the Pathophysiology of Preeclampsia.", "Intermedin1-53 protects the heart against isoproterenol-induced ischemic injury in rats.", "Adrenomedullin, an autocrine/paracrine factor induced by androgen withdrawal, stimulates 'neuroendocrine phenotype' in LNCaP prostate tumor cells.", "Novel regulation of cardiac metabolism and homeostasis by the adrenomedullin-receptor activity-modifying protein 2 system.", "Adrenomedullin receptors in rat cerebral microvessels.", "Adrenomedullin in rat follicles and corpora lutea: expression, functions and interaction with endothelin-1.", "Changes of adrenomedullin and receptor activity modifying protein 2 (RAMP2) in myocardium and aorta in rats with isoproterenol-induced myocardial ischemia.", "Characteristics of multi-organ lymphangiectasia resulting from temporal deletion of calcitonin receptor-like receptor in adult mice.", "Human calcitonin receptor-like receptor for adrenomedullin: genomic structure, eight single-nucleotide polymorphisms, and haplotype analysis.", "Alterations of intrarenal adrenomedullin and its receptor system in heart failure rats.", "The role of endogenous lung neuropeptides in regulation of the pulmonary circulation.", "Selective inactivation of adrenomedullin over calcitonin gene-related peptide receptor function by the deletion of amino acids 14-20 of the mouse calcitonin-like receptor.", "Association study of calcitonin-receptor-like receptor gene in essential hypertension.", "Differential expression of adrenomedullin and its receptor component, receptor activity modifying protein (RAMP) 2 during hypoxia in cultured human neuroblastoma cells.", "Inhibitory effects of two G protein-coupled receptor kinases on the cell surface expression and signaling of the human adrenomedullin receptor.", "Adrenomedullin increases the expression of calcitonin-like receptor and receptor activity modifying protein 2 mRNA in human microvascular endothelial cells.", "Adrenomedullin in the rat testis. II: Its production, actions on inhibin secretion, regulation by follicle-stimulating hormone, and its interaction with endothelin 1 in the Sertoli cell.", "Fluorescently labeled adrenomedullin allows real-time monitoring of adrenomedullin receptor trafficking in living cells.", "[Circulation control by adrenomedullin 1 receptor complex].", "The role of the CGRP-receptor component protein (RCP) in adrenomedullin receptor signal transduction.", "Rat RAMP domains involved in adrenomedullin binding specificity.", "Adrenomedullin-RAMP2 system suppresses ER stress-induced tubule cell death and is involved in kidney protection.", "Structure-function analysis of helix 8 of human calcitonin receptor-like receptor within the adrenomedullin 1 receptor.", "Immunohistochemical localization of calcitonin receptor-like receptor and receptor activity-modifying proteins in the human cerebral vasculature.", "Andrenomedullin and cardiovascular responses in sepsis.", "Research resource: Haploinsufficiency of receptor activity-modifying protein-2 (RAMP2) causes reduced fertility, hyperprolactinemia, skeletal abnormalities, and endocrine dysfunction in mice.", "CGRP-alpha responsiveness of adult rat ventricular cardiomyocytes from normotensive and spontaneously hypertensive rats.", "Structural basis for extracellular interactions between calcitonin receptor-like receptor and receptor activity-modifying protein 2 for adrenomedullin-specific binding.", "The function of extracellular cysteines in the human adrenomedullin receptor.", "Neutralization of adrenomedullin inhibits the growth of human glioblastoma cell lines in vitro and suppresses tumor xenograft growth in vivo.", "Function of the cytoplasmic tail of human calcitonin receptor-like receptor in complex with receptor activity-modifying protein 2.", "Lack of linkage and association of adrenomedullin and its receptor genes in French Caucasian rheumatoid arthritis trio families."], "CRF": ["Receptor activity modifying proteins (RAMPs) interact with the VPAC2 receptor and CRF1 receptors and modulate their function."], "GPER/GPR30": [], "AM1": ["Calcitonin Receptors: Introduction", "Calcitonin and calcitonin receptor-like receptors: common themes with family B GPCRs?", "Complexing receptor pharmacology: modulation of family B G protein-coupled receptor function by RAMPs", "The third extracellular loop of the human calcitonin receptor-like receptor is crucial for the activation of adrenomedullin signalling.", "Functions of third extracellular loop and helix 8 of Family B GPCRs complexed with RAMPs and characteristics of their receptor trafficking.", "Novel receptor partners and function of receptor activity-modifying proteins.", "Flow cytometric analysis of the calcitonin receptor-like receptor domains responsible for cell-surface translocation of receptor activity-modifying proteins.", "Endothelial Restoration of Receptor Activity-Modifying Protein 2 Is Sufficient to Rescue Lethality, but Survivors Develop Dilated Cardiomyopathy.", "Novel peptide antagonists of adrenomedullin and calcitonin gene-related peptide receptors: identification, pharmacological characterization, and interactions with position 74 in receptor activity-modifying protein 1/3.", "Adrenomedullin is induced by hypoxia and enhances pancreatic cancer cell invasion.", "Role of cerebellar adrenomedullin in blood pressure regulation.", "Calcitonin and Amylin Receptor Peptide Interaction Mechanisms: INSIGHTS INTO PEPTIDE-BINDING MODES AND ALLOSTERIC MODULATION OF THE CALCITONIN RECEPTOR BY RECEPTOR ACTIVITY-MODIFYING PROTEINS.", "Osteoclast-like cells express receptor activity modifying protein 2: application of laser capture microdissection.", "Localization of calcitonin receptor-like receptor and receptor activity modifying protein 1 in enteric neurons, dorsal root ganglia, and the spinal cord of the rat.", "Receptor activity modifying proteins interaction with human and porcine calcitonin receptor-like receptor (CRLR) in HEK-293 cells.", "Structural Basis for Receptor Activity-Modifying Protein-Dependent Selective Peptide Recognition by a G Protein-Coupled Receptor.", "Sequencing of a calcitonin receptor-like receptor in salmon Oncorhynchus gorbuscha. Functional studies using the human receptor activity-modifying proteins.", "Specificity of porcine calcitonin receptor and calcitonin receptor-like receptor in the presence of receptor-activity-modifying proteins.", "Functional relevance of G-protein-coupled-receptor-associated proteins, exemplified by receptor-activity-modifying proteins (RAMPs).", "Adrenomedullin peptide: gene expression of adrenomedullin, its receptors and receptor activity modifying proteins, and receptor binding in rat testis--actions on testosterone secretion.", "Bacterial expression and purification of a heterodimeric adrenomedullin receptor extracellular domain complex using DsbC-assisted disulfide shuffling.", "Adrenomedullin in the rat testis. I: Its production, actions on testosterone secretion, regulation by human chorionic gonadotropin, and its interaction with endothelin 1 in the leydig cell.", "Enhanced vascular responses to adrenomedullin in mice overexpressing receptor-activity-modifying protein 2.", "Unaltered mRNA expression of calcitonin-like receptor and receptor activity modifying proteins in human arteries in stroke and myocardial infarction.", "Visualization of the calcitonin receptor-like receptor and its receptor activity-modifying proteins during internalization and recycling.", "Cloning, characterization and central nervous system distribution of receptor activity modifying proteins in the rat.", "Structure-function relationships of the N-terminus of receptor activity-modifying proteins.", "Identification of N-terminal receptor activity-modifying protein residues important for calcitonin gene-related peptide, adrenomedullin, and amylin receptor function.", "Intermedin stabilized endothelial barrier function and attenuated ventilator-induced lung injury in mice.", "The RAMP2/CRLR complex is a functional adrenomedullin receptor in human endothelial and vascular smooth muscle cells.", "Expression of calcitonin gene-related peptide type 1 receptor mRNA and their activity-modifying proteins in the rat nucleus accumbens.", "Progesterone upregulates calcitonin gene-related peptide and adrenomedullin receptor components and cyclic adenosine 3'5'-monophosphate generation in Eker rat uterine smooth muscle cell line.", "Antiapoptotic effect of calcitonin gene-related peptide on oxidative stress-induced injury in H9c2 cardiomyocytes via the RAMP1/CRLR complex.", "Protein-protein interaction and not glycosylation determines the binding selectivity of heterodimers between the calcitonin receptor-like receptor and the receptor activity-modifying proteins.", "Molecular basis of association of receptor activity-modifying protein 3 with the family B G protein-coupled secretin receptor.", "Mammalian calcitonin receptor-like receptor/receptor activity modifying protein complexes define calcitonin gene-related peptide and adrenomedullin receptors in Drosophila Schneider 2 cells.", "Novel function for receptor activity-modifying proteins (RAMPs) in post-endocytic receptor trafficking.", "Functional expression of heteromeric calcitonin gene-related peptide and adrenomedullin receptors in yeast.", "Receptor activity-modifying protein-dependent effects of mutations in the calcitonin receptor-like receptor: implications for adrenomedullin and calcitonin gene-related peptide pharmacology.", "An amylin receptor is revealed following co-transfection of a calcitonin receptor with receptor activity modifying proteins-1 or -3.", "Calcitonin gene-related peptide (CGRP) receptors are important to maintain cerebrovascular reactivity in chronic hypertension.", "A receptor activity modifying protein (RAMP)2-dependent adrenomedullin receptor is a calcitonin gene-related peptide receptor when coexpressed with human RAMP1.", "Adrenomedullin signalling in cardiomyocytes is dependent upon CRLR and RAMP2 expression.", "Structure-function analysis of amino acid 74 of human RAMP1 and RAMP3 and its role in peptide interactions with adrenomedullin and calcitonin gene-related peptide receptors.", "Characterization of the human calcitonin gene-related peptide receptor subtypes associated with receptor activity-modifying proteins.", "Co-expression of adrenomedullin and adrenomedullin receptors in rat epididymis: distinct physiological actions on anion transport.", "Involvement of vascular endothelial growth factor signaling in CLR/RAMP1 and CLR/RAMP2-mediated pro-angiogenic effect of intermedin on human vascular endothelial cells.", "Mouse receptor-activity-modifying proteins 1, -2 and -3: amino acid sequence, expression and function.", "Aspartate(69) of the calcitonin-like receptor is required for its functional expression together with receptor-activity-modifying proteins 1 and -2.", "Differential and cell-specific expression of calcitonin receptor-like receptor and receptor activity modifying proteins in the human uterus.", "Decreased gene expression of adrenomedullin receptor in mouse lungs during sepsis.", "Comparing the molecular pharmacology of CGRP and adrenomedullin.", "[Alterations of intermedin and its receptor system in oleic acid-induced acute lung injury of rats].", "Receptor activity-modifying protein (RAMP) isoform-specific regulation of adrenomedullin receptor trafficking by NHERF-1.", "Respective roles of calcitonin receptor-like receptor (CRLR) and receptor activity-modifying proteins (RAMP) in cell surface expression of CRLR/RAMP heterodimeric receptors.", "The seven amino acids of human RAMP2 (86) and RAMP3 (59) are critical for agonist binding to human adrenomedullin receptors.", "Functions of the cytoplasmic tails of the human receptor activity-modifying protein components of calcitonin gene-related peptide and adrenomedullin receptors.", "Dexamethasone increases RAMP1 and CRLR mRNA expressions in human vascular smooth muscle cells.", "Receptors for calcitonin gene-related peptide, adrenomedullin, and amylin: the contributions of novel receptor-activity-modifying proteins.", "The amino terminus of receptor activity modifying proteins is a critical determinant of glycosylation state and ligand binding of calcitonin receptor-like receptor.", "Molecular cloning and pharmacological characterization of bovine calcitonin receptor-like receptor from bovine aortic endothelial cells.", "Glycosylation of human CRLR at Asn123 is required for ligand binding and signaling.", "Multiple ramp domains are required for generation of amylin receptor phenotype from the calcitonin receptor gene product.", "Ligand-induced internalization, recycling, and resensitization of adrenomedullin receptors depend not on CLR or RAMP alone but on the receptor complex as a whole.", "Gene silencing of human RAMP2 mediated by short-interfering RNA.", "Receptor Activity-modifying Proteins 2 and 3 Generate Adrenomedullin Receptor Subtypes with Distinct Molecular Properties.", "Adrenomedullin is increased in alveolar macrophages and released from the lungs into the circulation in severe heart failure.", "Receptor activity-modifying proteins 2 and 3 have distinct physiological functions from embryogenesis to old age.", "Expression and distribution of the adrenomedullin system in newborn human thymus.", "Characterization of the single transmembrane domain of human receptor activity-modifying protein 3 in adrenomedullin receptor internalization.", "The role of adrenomedullin and receptors in glomerular hyperfiltration in streptozotocin-induced diabetic rats.", "Involvement of Receptor Activity-Modifying Protein 3 (RAMP3) in the Vascular Actions of Adrenomedullin in Rat Mesenteric Artery Smooth Muscle Cells.", "CL/RAMP2 and CL/RAMP3 produce pharmacologically distinct adrenomedullin receptors: a comparison of effects of adrenomedullin22-52, CGRP8-37 and BIBN4096BS.", "Functional Analysis of the Adrenomedullin Pathway in Malignant Pleural Mesothelioma.", "Adrenomedullin and its receptor complexes in remnant kidneys of rats with renal mass ablation: decreased expression of calcitonin receptor-like receptor and receptor-activity modifying protein-3.", "Adrenomedullin2 (ADM2)/Intermedin (IMD): A Potential Role in the Pathophysiology of Preeclampsia.", "Intermedin1-53 protects the heart against isoproterenol-induced ischemic injury in rats.", "Adrenomedullin, an autocrine/paracrine factor induced by androgen withdrawal, stimulates 'neuroendocrine phenotype' in LNCaP prostate tumor cells.", "Novel regulation of cardiac metabolism and homeostasis by the adrenomedullin-receptor activity-modifying protein 2 system.", "Adrenomedullin receptors in rat cerebral microvessels.", "Changes of adrenomedullin and receptor activity modifying protein 2 (RAMP2) in myocardium and aorta in rats with isoproterenol-induced myocardial ischemia.", "Characteristics of multi-organ lymphangiectasia resulting from temporal deletion of calcitonin receptor-like receptor in adult mice.", "Human calcitonin receptor-like receptor for adrenomedullin: genomic structure, eight single-nucleotide polymorphisms, and haplotype analysis.", "Alterations of intrarenal adrenomedullin and its receptor system in heart failure rats.", "The role of endogenous lung neuropeptides in regulation of the pulmonary circulation.", "Selective inactivation of adrenomedullin over calcitonin gene-related peptide receptor function by the deletion of amino acids 14-20 of the mouse calcitonin-like receptor.", "Association study of calcitonin-receptor-like receptor gene in essential hypertension.", "Differential expression of adrenomedullin and its receptor component, receptor activity modifying protein (RAMP) 2 during hypoxia in cultured human neuroblastoma cells.", "Inhibitory effects of two G protein-coupled receptor kinases on the cell surface expression and signaling of the human adrenomedullin receptor.", "Adrenomedullin increases the expression of calcitonin-like receptor and receptor activity modifying protein 2 mRNA in human microvascular endothelial cells.", "Adrenomedullin in the rat testis. II: Its production, actions on inhibin secretion, regulation by follicle-stimulating hormone, and its interaction with endothelin 1 in the Sertoli cell.", "Fluorescently labeled adrenomedullin allows real-time monitoring of adrenomedullin receptor trafficking in living cells.", "[Circulation control by adrenomedullin 1 receptor complex].", "The role of the CGRP-receptor component protein (RCP) in adrenomedullin receptor signal transduction.", "Rat RAMP domains involved in adrenomedullin binding specificity.", "Adrenomedullin-RAMP2 system suppresses ER stress-induced tubule cell death and is involved in kidney protection.", "Structure-function analysis of helix 8 of human calcitonin receptor-like receptor within the adrenomedullin 1 receptor.", "Immunohistochemical localization of calcitonin receptor-like receptor and receptor activity-modifying proteins in the human cerebral vasculature.", "Andrenomedullin and cardiovascular responses in sepsis.", "Research resource: Haploinsufficiency of receptor activity-modifying protein-2 (RAMP2) causes reduced fertility, hyperprolactinemia, skeletal abnormalities, and endocrine dysfunction in mice.", "CGRP-alpha responsiveness of adult rat ventricular cardiomyocytes from normotensive and spontaneously hypertensive rats.", "Structural basis for extracellular interactions between calcitonin receptor-like receptor and receptor activity-modifying protein 2 for adrenomedullin-specific binding.", "The function of extracellular cysteines in the human adrenomedullin receptor.", "Neutralization of adrenomedullin inhibits the growth of human glioblastoma cell lines in vitro and suppresses tumor xenograft growth in vivo.", "Function of the cytoplasmic tail of human calcitonin receptor-like receptor in complex with receptor activity-modifying protein 2.", "Lack of linkage and association of adrenomedullin and its receptor genes in French Caucasian rheumatoid arthritis trio families.", "Selective CGRP and adrenomedullin peptide binding by tethered RAMP-calcitonin receptor-like receptor extracellular domain fusion proteins.", "Characterization and effects on cAMP accumulation of adrenomedullin and calcitonin gene-related peptide (CGRP) receptors in dissociated rat spinal cord cell culture.", "Ectodomain structures of the CGRP and AM receptors.", "Regulation of adrenomedullin and its family peptide by RAMP system--lessons from genetically engineered mice.", "Receptor activity-modifying proteins; multifunctional G protein-coupled receptor accessory proteins.", "Intermedin (adrenomedullin2) stabilizes the endothelial barrier and antagonizes thrombin-induced barrier failure in endothelial cell monolayers.", "Glucocorticoids alter adrenomedullin receptor expression and secretion in endothelial-like cells and astrocytes.", "Molecular and functional characterization of adrenomedullin receptors in pufferfish.", "Cardiovascular effects of exogenous adrenomedullin and CGRP in Ramp and Calcrl deficient mice.", "Potentiated adrenomedullin-induced vasorelaxation during hypoxia in organ cultured porcine coronary arteries."], "PTH1": ["Novel receptor partners and function of receptor activity-modifying proteins."], "PTH2": ["Novel receptor partners and function of receptor activity-modifying proteins."], "AM2": ["Calcitonin Receptors: Introduction", "Calcitonin and calcitonin receptor-like receptors: common themes with family B GPCRs?", "Complexing receptor pharmacology: modulation of family B G protein-coupled receptor function by RAMPs", "Novel receptor partners and function of receptor activity-modifying proteins", "The third extracellular loop of the human calcitonin receptor-like receptor is crucial for the activation of adrenomedullin signalling.", "Functions of third extracellular loop and helix 8 of Family B GPCRs complexed with RAMPs and characteristics of their receptor trafficking.", "Novel receptor partners and function of receptor activity-modifying proteins.", "Flow cytometric analysis of the calcitonin receptor-like receptor domains responsible for cell-surface translocation of receptor activity-modifying proteins.", "Novel peptide antagonists of adrenomedullin and calcitonin gene-related peptide receptors: identification, pharmacological characterization, and interactions with position 74 in receptor activity-modifying protein 1/3.", "Adrenomedullin is induced by hypoxia and enhances pancreatic cancer cell invasion.", "Role of cerebellar adrenomedullin in blood pressure regulation.", "Osteoclast-like cells express receptor activity modifying protein 2: application of laser capture microdissection.", "Heterodimers and family-B GPCRs: RAMPs, CGRP and adrenomedullin.", "Localization of calcitonin receptor-like receptor and receptor activity modifying protein 1 in enteric neurons, dorsal root ganglia, and the spinal cord of the rat.", "Receptor activity modifying proteins interaction with human and porcine calcitonin receptor-like receptor (CRLR) in HEK-293 cells.", "Sequencing of a calcitonin receptor-like receptor in salmon Oncorhynchus gorbuscha. Functional studies using the human receptor activity-modifying proteins.", "A critical role for the short intracellular C terminus in receptor activity-modifying protein function.", "Specificity of porcine calcitonin receptor and calcitonin receptor-like receptor in the presence of receptor-activity-modifying proteins.", "Functional relevance of G-protein-coupled-receptor-associated proteins, exemplified by receptor-activity-modifying proteins (RAMPs).", "Adrenomedullin peptide: gene expression of adrenomedullin, its receptors and receptor activity modifying proteins, and receptor binding in rat testis--actions on testosterone secretion.", "Bacterial expression and purification of a heterodimeric adrenomedullin receptor extracellular domain complex using DsbC-assisted disulfide shuffling.", "Adrenomedullin in the rat testis. I: Its production, actions on testosterone secretion, regulation by human chorionic gonadotropin, and its interaction with endothelin 1 in the leydig cell.", "Unaltered mRNA expression of calcitonin-like receptor and receptor activity modifying proteins in human arteries in stroke and myocardial infarction.", "Visualization of the calcitonin receptor-like receptor and its receptor activity-modifying proteins during internalization and recycling.", "Structure-function analysis of RAMP1-RAMP3 chimeras.", "Cloning, characterization and central nervous system distribution of receptor activity modifying proteins in the rat.", "Identification of N-terminal receptor activity-modifying protein residues important for calcitonin gene-related peptide, adrenomedullin, and amylin receptor function.", "Intermedin stabilized endothelial barrier function and attenuated ventilator-induced lung injury in mice.", "The RAMP2/CRLR complex is a functional adrenomedullin receptor in human endothelial and vascular smooth muscle cells.", "Expression of calcitonin gene-related peptide type 1 receptor mRNA and their activity-modifying proteins in the rat nucleus accumbens.", "Progesterone upregulates calcitonin gene-related peptide and adrenomedullin receptor components and cyclic adenosine 3'5'-monophosphate generation in Eker rat uterine smooth muscle cell line.", "Antiapoptotic effect of calcitonin gene-related peptide on oxidative stress-induced injury in H9c2 cardiomyocytes via the RAMP1/CRLR complex.", "Molecular basis of association of receptor activity-modifying protein 3 with the family B G protein-coupled secretin receptor.", "Amylin receptor phenotypes derived from human calcitonin receptor/RAMP coexpression exhibit pharmacological differences dependent on receptor isoform and host cell environment.", "Novel function for receptor activity-modifying proteins (RAMPs) in post-endocytic receptor trafficking.", "Functional expression of heteromeric calcitonin gene-related peptide and adrenomedullin receptors in yeast.", "Receptor activity-modifying protein-dependent effects of mutations in the calcitonin receptor-like receptor: implications for adrenomedullin and calcitonin gene-related peptide pharmacology.", "Structure-function analysis of amino acid 74 of human RAMP1 and RAMP3 and its role in peptide interactions with adrenomedullin and calcitonin gene-related peptide receptors.", "Characterization of the human calcitonin gene-related peptide receptor subtypes associated with receptor activity-modifying proteins.", "Involvement of vascular endothelial growth factor signaling in CLR/RAMP1 and CLR/RAMP2-mediated pro-angiogenic effect of intermedin on human vascular endothelial cells.", "Receptor pharmacology.", "Differential and cell-specific expression of calcitonin receptor-like receptor and receptor activity modifying proteins in the human uterus.", "Decreased gene expression of adrenomedullin receptor in mouse lungs during sepsis.", "Receptor activity-modifying protein (RAMP) isoform-specific regulation of adrenomedullin receptor trafficking by NHERF-1.", "Respective roles of calcitonin receptor-like receptor (CRLR) and receptor activity-modifying proteins (RAMP) in cell surface expression of CRLR/RAMP heterodimeric receptors.", "The seven amino acids of human RAMP2 (86) and RAMP3 (59) are critical for agonist binding to human adrenomedullin receptors.", "Receptors for calcitonin gene-related peptide, adrenomedullin, and amylin: the contributions of novel receptor-activity-modifying proteins.", "The amino terminus of receptor activity modifying proteins is a critical determinant of glycosylation state and ligand binding of calcitonin receptor-like receptor.", "Molecular cloning and pharmacological characterization of bovine calcitonin receptor-like receptor from bovine aortic endothelial cells.", "Glycosylation of human CRLR at Asn123 is required for ligand binding and signaling.", "Ligand-induced internalization, recycling, and resensitization of adrenomedullin receptors depend not on CLR or RAMP alone but on the receptor complex as a whole.", "Gene silencing of human RAMP2 mediated by short-interfering RNA.", "Receptor Activity-modifying Proteins 2 and 3 Generate Adrenomedullin Receptor Subtypes with Distinct Molecular Properties.", "Adrenomedullin is increased in alveolar macrophages and released from the lungs into the circulation in severe heart failure.", "Receptor activity-modifying proteins 2 and 3 have distinct physiological functions from embryogenesis to old age.", "Expression and distribution of the adrenomedullin system in newborn human thymus.", "Parathyroid hormone induces receptor activity modifying protein-3 (RAMP3) expression primarily via 3',5'-cyclic adenosine monophosphate signaling in osteoblasts.", "Characterization of the single transmembrane domain of human receptor activity-modifying protein 3 in adrenomedullin receptor internalization.", "The pharmacology of adrenomedullin 2/intermedin.", "The role of adrenomedullin and receptors in glomerular hyperfiltration in streptozotocin-induced diabetic rats.", "Novel regulation of adrenomedullin receptor by PDGF: role of receptor activity modifying protein-3.", "Functional characterization of two human receptor activity-modifying protein 3 variants.", "Intermedin is upregulated and has protective roles in a mouse ischemia/reperfusion model.", "Involvement of Receptor Activity-Modifying Protein 3 (RAMP3) in the Vascular Actions of Adrenomedullin in Rat Mesenteric Artery Smooth Muscle Cells.", "CL/RAMP2 and CL/RAMP3 produce pharmacologically distinct adrenomedullin receptors: a comparison of effects of adrenomedullin22-52, CGRP8-37 and BIBN4096BS.", "N-Glycosylation and conserved cysteine residues in RAMP3 play a critical role for the functional expression of CRLR/RAMP3 adrenomedullin receptor.", "Loss of receptor activity-modifying protein 3 exacerbates cardiac hypertrophy and transition to heart failure in a sex-dependent manner.", "Functional Analysis of the Adrenomedullin Pathway in Malignant Pleural Mesothelioma.", "Adrenomedullin and its receptor complexes in remnant kidneys of rats with renal mass ablation: decreased expression of calcitonin receptor-like receptor and receptor-activity modifying protein-3.", "Adrenomedullin2 (ADM2)/Intermedin (IMD): A Potential Role in the Pathophysiology of Preeclampsia.", "Intermedin1-53 protects the heart against isoproterenol-induced ischemic injury in rats.", "Ectodomain structures of the CGRP and AM receptors.", "Molecular and functional characterization of adrenomedullin receptors in pufferfish.", "Cardiovascular effects of exogenous adrenomedullin and CGRP in Ramp and Calcrl deficient mice."], "CGRP": ["Calcitonin Receptors: Introduction", "Calcitonin and calcitonin receptor-like receptors: common themes with family B GPCRs?", "Complexing receptor pharmacology: modulation of family B G protein-coupled receptor function by RAMPs", "Novel receptor partners and function of receptor activity-modifying proteins", "The third extracellular loop of the human calcitonin receptor-like receptor is crucial for the activation of adrenomedullin signalling.", "Functions of third extracellular loop and helix 8 of Family B GPCRs complexed with RAMPs and characteristics of their receptor trafficking.", "Flow cytometric analysis of the calcitonin receptor-like receptor domains responsible for cell-surface translocation of receptor activity-modifying proteins.", "Extracellular loops 1 and 3 and their associated transmembrane regions of the calcitonin receptor-like receptor are needed for CGRP receptor function.", "The transmembrane domain of receptor-activity-modifying protein 1 is essential for the functional expression of a calcitonin gene-related peptide receptor.", "Novel peptide antagonists of adrenomedullin and calcitonin gene-related peptide receptors: identification, pharmacological characterization, and interactions with position 74 in receptor activity-modifying protein 1/3.", "Adrenomedullin is induced by hypoxia and enhances pancreatic cancer cell invasion.", "Roles of receptor activity-modifying protein 1 in angiogenesis and lymphangiogenesis during skin wound healing in mice.", "Periaqueductal gray calcitonin gene-related peptide modulates trigeminovascular neurons.", "Identification and pharmacological characterization of domains involved in binding of CGRP receptor antagonists to the calcitonin-like receptor.", "Role of cerebellar adrenomedullin in blood pressure regulation.", "Determinants of 1-piperidinecarboxamide, N-[2-[[5-amino-l-[[4-(4-pyridinyl)-l-piperazinyl]carbonyl]pentyl]amino]-1-[(3,5-dibromo-4-hydroxyphenyl)methyl]-2-oxoethyl]-4-(1,4-dihydro-2-oxo-3(2H)-quinazolinyl) (BIBN4096BS) affinity for calcitonin gene-related peptide and amylin receptors--the role of receptor activity modifying protein 1.", "Adrenomedullin 2 Enhances Beiging in White Adipose Tissue Directly in an Adipocyte-autonomous Manner and Indirectly through Activation of M2 Macrophages.", "[Regulatory mechanisms of calcitonin gene-related peptide (CGRP) in skin inflammation].", "Calcitonin and Amylin Receptor Peptide Interaction Mechanisms: INSIGHTS INTO PEPTIDE-BINDING MODES AND ALLOSTERIC MODULATION OF THE CALCITONIN RECEPTOR BY RECEPTOR ACTIVITY-MODIFYING PROTEINS.", "Identification of the human receptor activity-modifying protein 1 domains responsible for agonist binding specificity.", "Osteoclast-like cells express receptor activity modifying protein 2: application of laser capture microdissection.", "Activation of calcitonin gene-related peptide signaling through the prostaglandin E2-EP1/EP2/EP4 receptor pathway in synovium of knee osteoarthritis patients.", "Locally synthesized calcitonin gene-related Peptide has a critical role in peripheral nerve regeneration.", "Ligand binding and activation of the CGRP receptor.", "Heterodimers and family-B GPCRs: RAMPs, CGRP and adrenomedullin.", "Localization of calcitonin receptor-like receptor and receptor activity modifying protein 1 in enteric neurons, dorsal root ganglia, and the spinal cord of the rat.", "The second intracellular loop of the calcitonin gene-related peptide receptor provides molecular determinants for signal transduction and cell surface expression.", "Molecular cloning and characterization of mouse calcitonin gene-related peptide receptor.", "Calcitonin gene-related peptide enhances experimental autoimmune encephalomyelitis by promoting Th17-cell functions.", "Receptor activity modifying proteins interaction with human and porcine calcitonin receptor-like receptor (CRLR) in HEK-293 cells.", "Non-peptidic antagonists of the CGRP receptor, BIBN4096BS and MK-0974, interact with the calcitonin receptor-like receptor via methionine-42 and RAMP1 via tryptophan-74.", "Interaction of receptor-activity-modifying protein1 with tubulin.", "The activation of the CGRP receptor.", "Mapping the CGRP receptor ligand binding domain: tryptophan-84 of RAMP1 is critical for agonist and antagonist binding.", "Endosomal proteolysis regulates calcitonin gene-related peptide responses in mesenteric arteries.", "Structural Basis for Receptor Activity-Modifying Protein-Dependent Selective Peptide Recognition by a G Protein-Coupled Receptor.", "Localization of the calcitonin gene-related peptide receptor complex at the vertebrate neuromuscular junction and its role in regulating acetylcholinesterase expression.", "Expression of functional receptor activity modifying protein 1 by airway epithelial cells with dysregulation in asthma.", "Antipsychotic-like actions of the satiety peptide, amylin, in ventral striatal regions marked by overlapping calcitonin receptor and RAMP-1 gene expression.", "Adrenomedullin and related peptides: receptors and accessory proteins.", "Modulation of nocioceptive transmission with calcitonin gene-related peptide receptor antagonists in the thalamus.", "Sequencing of a calcitonin receptor-like receptor in salmon Oncorhynchus gorbuscha. Functional studies using the human receptor activity-modifying proteins.", "A critical role for the short intracellular C terminus in receptor activity-modifying protein function.", "Specificity of porcine calcitonin receptor and calcitonin receptor-like receptor in the presence of receptor-activity-modifying proteins.", "Receptor component protein (RCP): a member of a multi-protein complex required for G-protein-coupled signal transduction.", "Functional relevance of G-protein-coupled-receptor-associated proteins, exemplified by receptor-activity-modifying proteins (RAMPs).", "Quinoline derivatives: candidate drugs for a class B G-protein coupled receptor, the calcitonin gene-related peptide receptor, a cause of migraines.", "Adrenomedullin peptide: gene expression of adrenomedullin, its receptors and receptor activity modifying proteins, and receptor binding in rat testis--actions on testosterone secretion.", "Deficiency of RAMP1 attenuates antigen-induced airway hyperresponsiveness in mice.", "The N-terminal extracellular domain 23-60 of the calcitonin receptor-like receptor in chimeras with the parathyroid hormone receptor mediates association with receptor activity-modifying protein 1.", "Bacterial expression and purification of a heterodimeric adrenomedullin receptor extracellular domain complex using DsbC-assisted disulfide shuffling.", "Adrenomedullin in the rat testis. I: Its production, actions on testosterone secretion, regulation by human chorionic gonadotropin, and its interaction with endothelin 1 in the leydig cell.", "A second trigeminal CGRP receptor: function and expression of the AMY1 receptor.", "Enhanced vascular responses to adrenomedullin in mice overexpressing receptor-activity-modifying protein 2.", "Unaltered mRNA expression of calcitonin-like receptor and receptor activity modifying proteins in human arteries in stroke and myocardial infarction.", "Visualization of the calcitonin receptor-like receptor and its receptor activity-modifying proteins during internalization and recycling.", "Structure-function analysis of RAMP1-RAMP3 chimeras.", "The extracellular domain of receptor activity-modifying protein 1 is sufficient for calcitonin receptor-like receptor function.", "Receptor activity-modifying protein 1 determines the species selectivity of non-peptide CGRP receptor antagonists.", "Cloning, characterization and central nervous system distribution of receptor activity modifying proteins in the rat.", "Structure-function relationships of the N-terminus of receptor activity-modifying proteins.", "Structure-function analysis of RAMP1 by alanine mutagenesis.", "Immature human osteoblastic MG63 cells predominantly express a subtype 1-like CGRP receptor that inactivates extracellular signal response kinase by a cAMP-dependent mechanism.", "Identification of N-terminal receptor activity-modifying protein residues important for calcitonin gene-related peptide, adrenomedullin, and amylin receptor function.", "Intermedin stabilized endothelial barrier function and attenuated ventilator-induced lung injury in mice.", "The RAMP2/CRLR complex is a functional adrenomedullin receptor in human endothelial and vascular smooth muscle cells.", "Ca2+ signaling in human fetoplacental vasculature: effect of CGRP on umbilical vein smooth muscle cytosolic Ca2+ concentration.", "Receptor-activity-modifying protein 1 forms heterodimers with two G-protein-coupled receptors to define ligand recognition.", "Expression of calcitonin gene-related peptide type 1 receptor mRNA and their activity-modifying proteins in the rat nucleus accumbens.", "Progesterone upregulates calcitonin gene-related peptide and adrenomedullin receptor components and cyclic adenosine 3'5'-monophosphate generation in Eker rat uterine smooth muscle cell line.", "Antiapoptotic effect of calcitonin gene-related peptide on oxidative stress-induced injury in H9c2 cardiomyocytes via the RAMP1/CRLR complex.", "Protein-protein interaction and not glycosylation determines the binding selectivity of heterodimers between the calcitonin receptor-like receptor and the receptor activity-modifying proteins.", "Pharmacological characterization of novel alpha-Calcitonin Gene-Related Peptide (CGRP) receptor peptide antagonists that are selective for human CGRP receptors.", "Molecular basis of association of receptor activity-modifying protein 3 with the family B G protein-coupled secretin receptor.", "STC1 interference on calcitonin family of receptors signaling during osteoblastogenesis via adenylate cyclase inhibition.", "The function of conserved cysteine residues in the extracellular domain of human receptor-activity-modifying protein.", "Localization of CGRP receptor components and receptor binding sites in rhesus monkey brainstem: A detailed study using in situ hybridization, immunofluorescence, and autoradiography.", "Mammalian calcitonin receptor-like receptor/receptor activity modifying protein complexes define calcitonin gene-related peptide and adrenomedullin receptors in Drosophila Schneider 2 cells.", "Amylin receptor phenotypes derived from human calcitonin receptor/RAMP coexpression exhibit pharmacological differences dependent on receptor isoform and host cell environment.", "Studies on the effects of the N-terminal domain antibodies of calcitonin receptor-like receptor and receptor activity-modifying protein 1 on calcitonin gene-related peptide-induced vasorelaxation in rat uterine artery.", "Female sex steroid hormones and pregnancy regulate receptors for calcitonin gene-related peptide in rat mesenteric arteries, but not in aorta.", "Localization of CGRP, CGRP receptor, PACAP and glutamate in trigeminal ganglion. Relation to the blood-brain barrier.", "Mapping interaction sites within the N-terminus of the calcitonin gene-related peptide receptor; the role of residues 23-60 of the calcitonin receptor-like receptor.", "Novel function for receptor activity-modifying proteins (RAMPs) in post-endocytic receptor trafficking.", "Calcitonin gene-related peptide receptor activation by receptor activity-modifying protein-1 gene transfer to vascular smooth muscle cells.", "Calcitonin gene-related peptide is an important regulator of cutaneous immunity: effect on dendritic cell and T cell functions.", "Interaction of calcitonin-gene-related peptide with its receptors.", "Crystal structure of the human receptor activity-modifying protein 1 extracellular domain.", "Differential localization and characterization of functional calcitonin gene-related peptide receptors in human subcutaneous arteries.", "Refolding and characterization of a soluble ectodomain complex of the calcitonin gene-related peptide receptor.", "Functional expression of heteromeric calcitonin gene-related peptide and adrenomedullin receptors in yeast.", "Haplotype-based case-control study of receptor (calcitonin) activity-modifying protein-1 gene in cerebral infarction.", "Receptor activity-modifying protein-dependent effects of mutations in the calcitonin receptor-like receptor: implications for adrenomedullin and calcitonin gene-related peptide pharmacology.", "Evidence for decreased calcitonin gene-related peptide (CGRP) receptors and compromised responsiveness to CGRP of fetoplacental vessels in preeclamptic pregnancies.", "Maturation of suprathreshold auditory nerve activity involves cochlear CGRP-receptor complex formation.", "An amylin receptor is revealed following co-transfection of a calcitonin receptor with receptor activity modifying proteins-1 or -3.", "Calcitonin gene-related peptide (CGRP) receptors are important to maintain cerebrovascular reactivity in chronic hypertension.", "A receptor activity modifying protein (RAMP)2-dependent adrenomedullin receptor is a calcitonin gene-related peptide receptor when coexpressed with human RAMP1.", "GPCRs as potential therapeutic targets in preeclampsia.", "Adrenomedullin signalling in cardiomyocytes is dependent upon CRLR and RAMP2 expression.", "Assembly and signaling of CRLR and RAMP1 complexes assessed by BRET.", "Functional interaction of G protein-coupled receptors of the adrenomedullin peptide family with accessory receptor-activity-modifying proteins (RAMP).", "The role of ECL2 in CGRP receptor activation: a combined modelling and experimental approach.", "Structure-function analysis of amino acid 74 of human RAMP1 and RAMP3 and its role in peptide interactions with adrenomedullin and calcitonin gene-related peptide receptors.", "Identification of specific calcitonin-like receptor residues important for calcitonin gene-related peptide high affinity binding.", "Characterization of the human calcitonin gene-related peptide receptor subtypes associated with receptor activity-modifying proteins.", "Direct interactions between calcitonin-like receptor (CLR) and CGRP-receptor component protein (RCP) regulate CGRP receptor signaling.", "The role of the extracellular loops of the CGRP receptor, a family B GPCR.", "Glyceroltrinitrate facilitates stimulated CGRP release but not gene expression of CGRP or its receptor components in rat trigeminal ganglia.", "Calcitonin gene-related peptide and its receptor components in the human sphenopalatine ganglion -- interaction with the sensory system.", "Co-expression of adrenomedullin and adrenomedullin receptors in rat epididymis: distinct physiological actions on anion transport.", "Localization of receptors for calcitonin-gene-related peptide to intraganglionic laminar endings of the mouse esophagus: peripheral interaction between vagal and spinal afferents?", "Targeting a family B GPCR/RAMP receptor complex: CGRP receptor antagonists and migraine.", "Involvement of vascular endothelial growth factor signaling in CLR/RAMP1 and CLR/RAMP2-mediated pro-angiogenic effect of intermedin on human vascular endothelial cells.", "Kynurenic acid modulates experimentally induced inflammation in the trigeminal ganglion.", "Endothelin-converting enzyme-1 regulates endosomal sorting of calcitonin receptor-like receptor and beta-arrestins.", "Activation of calcitonin receptor and calcitonin receptor-like receptor by membrane-anchored ligands.", "Localization of CGRP receptor components, CGRP, and receptor binding sites in human and rhesus cerebellar cortex.", "Mouse receptor-activity-modifying proteins 1, -2 and -3: amino acid sequence, expression and function.", "RAMPs and CGRP receptors.", "The CGRP receptor can couple via pertussis toxin sensitive and insensitive G proteins.", "Receptor pharmacology.", "Functional calcitonin gene-related peptide subtype 2 receptors in porcine coronary arteries are identified as calcitonin gene-related peptide subtype 1 receptors by radioligand binding and reverse transcription-polymerase chain reaction.", "CGRP in the trigeminovascular system: a role for CGRP, adrenomedullin and amylin receptors?", "Aspartate(69) of the calcitonin-like receptor is required for its functional expression together with receptor-activity-modifying proteins 1 and -2.", "Calcitonin Gene-Related Peptide Rescues Proximity Associations of Its Receptor Components, Calcitonin Receptor-Like Receptor and Receptor Activity-Modifying Protein 1, in Rat Uterine Artery Smooth Muscle Cells Exposed to Tumor Necrosis Factor Alpha.", "Differential and cell-specific expression of calcitonin receptor-like receptor and receptor activity modifying proteins in the human uterus.", "Role of CGRP-receptor component protein (RCP) in CLR/RAMP function.", "Decreased gene expression of adrenomedullin receptor in mouse lungs during sepsis.", "Comparing the molecular pharmacology of CGRP and adrenomedullin.", "CGRP receptor antagonism and migraine therapy.", "[Alterations of intermedin and its receptor system in oleic acid-induced acute lung injury of rats].", "Receptor activity-modifying protein (RAMP) isoform-specific regulation of adrenomedullin receptor trafficking by NHERF-1.", "Respective roles of calcitonin receptor-like receptor (CRLR) and receptor activity-modifying proteins (RAMP) in cell surface expression of CRLR/RAMP heterodimeric receptors.", "The seven amino acids of human RAMP2 (86) and RAMP3 (59) are critical for agonist binding to human adrenomedullin receptors.", "Regulation and function of the CGRP receptor complex in human granulopoiesis.", "Functions of the cytoplasmic tails of the human receptor activity-modifying protein components of calcitonin gene-related peptide and adrenomedullin receptors.", "Dexamethasone increases RAMP1 and CRLR mRNA expressions in human vascular smooth muscle cells.", "Proceedings of the 4th International Meeting on Calcitonin Gene-Related Peptide and its Receptor.", "Receptors for calcitonin gene-related peptide, adrenomedullin, and amylin: the contributions of novel receptor-activity-modifying proteins.", "The amino terminus of receptor activity modifying proteins is a critical determinant of glycosylation state and ligand binding of calcitonin receptor-like receptor.", "Molecular cloning and pharmacological characterization of bovine calcitonin receptor-like receptor from bovine aortic endothelial cells.", "Agonist-promoted internalization of a ternary complex between calcitonin receptor-like receptor, receptor activity-modifying protein 1 (RAMP1), and beta-arrestin.", "Mutations of the asparagine117 residue of a receptor activity-modifying protein 1-dependent human calcitonin gene-related peptide receptor result in selective loss of function.", "Glycosylation of human CRLR at Asn123 is required for ligand binding and signaling.", "CGRP and its receptors.", "Characterization of the structure of RAMP1 by mutagenesis and molecular modeling.", "Multiple ramp domains are required for generation of amylin receptor phenotype from the calcitonin receptor gene product.", "Functional calcitonin gene-related peptide receptors are formed by the asymmetric assembly of a calcitonin receptor-like receptor homo-oligomer and a monomer of receptor activity-modifying protein-1.", "Selective CGRP and adrenomedullin peptide binding by tethered RAMP-calcitonin receptor-like receptor extracellular domain fusion proteins.", "Characterization and effects on cAMP accumulation of adrenomedullin and calcitonin gene-related peptide (CGRP) receptors in dissociated rat spinal cord cell culture.", "Ectodomain structures of the CGRP and AM receptors.", "Regulation of adrenomedullin and its family peptide by RAMP system--lessons from genetically engineered mice.", "Receptor activity-modifying proteins; multifunctional G protein-coupled receptor accessory proteins.", "Molecular and functional characterization of adrenomedullin receptors in pufferfish.", "Cardiovascular effects of exogenous adrenomedullin and CGRP in Ramp and Calcrl deficient mice.", "Potentiated adrenomedullin-induced vasorelaxation during hypoxia in organ cultured porcine coronary arteries.", "Diverse functional motifs within the three intracellular loops of the CGRP1 receptor.", "The Trigeminovascular Pathway: Role of CGRP and CGRP Receptors in Migraine.", "Immunohistochemical localization of the calcitonin gene-related peptide binding site in the primate trigeminovascular system using functional antagonist antibodies.", "Changes in calcitonin gene-related peptide (CGRP) receptor component and nitric oxide receptor (sGC) immunoreactivity in rat trigeminal ganglion following glyceroltrinitrate pretreatment.", "International Union of Pharmacology. LXIX. Status of the calcitonin gene-related peptide subtype 2 receptor.", "Overexpression and purification of human calcitonin gene-related peptide-receptor component protein in Escherichia coli.", "Crystal structure of the ectodomain complex of the CGRP receptor, a class-B GPCR, reveals the site of drug antagonism.", "Binding and functional pharmacological characteristics of gepant-type antagonists in rat brain and mesenteric arteries.", "Understanding RAMPs through genetically engineered mouse models."]}
